# Create Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LoadCombination..::..Create Method
LoadCombination Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, String) | Creates a new default LoadCombination. |
| Create(Document, String, LoadCombinationType, LoadCombinationState) | Creates a new LoadCombination. |

# See Also
LoadCombination Class
LoadCombination Members
Autodesk.Revit.DB.Structure Namespace